# GROUPS_TEMPLATE = [
#     {
#         'id': 0,
#         'name': '',
#         'topics': [],
#     },
#     ...
# ]


GROUPS_WITH_BETTER_PREPROCESS_EN = [
    {
        'id': 0,
        'name': 'Вопросы пользователя по политике безопасности',
        'topics': [0, ],
    },
    {
        'id': 1,
        'name': 'Сторонние веб-сайты',
        'topics': [2, ],
    },
    {
        'id': 2,
        'name': 'Особая аудитория',
        'topics': [3, 6, ],
    },
    {
        'id': 3,
        'name': 'Защита персональных данных',
        'topics': [4, ],
    },
    {
        'id': 4,
        'name': 'Сбор персональных данных',
        'topics': [5, 9, 10, 1, 12, 14, 17, 21, 22, ],
    },
    {
        'id': 5,
        'name': 'Сбор трекинговых персональных данных',
        'topics': [18, ],
    },
    {
        'id': 6,
        'name': 'Распространение персональных данных',
        'topics': [7, 11, 15, ],
    },
    {
        'id': 7,
        'name': 'Накопление персональных данных',
        'topics': [8, ],
    },
    {
        'id': 8,
        'name': 'Персонализация и маркетинг',
        'topics': [13, 20, ],
    },
    {
        'id': 9,
        'name': 'Изменение политики безопасности',
        'topics': [16, 19, ],
    },
]

GROUPS_WITH_BETTER_PREPROCESS_RU = [
    {
        'id': 0,
        'name': 'Термины и определения политики',
        'topics': [5, 8, 10, 11, 34 ],
    },
    {
        'id': 1,
        'name': 'Сбор трекинговых персональных данных',
        'topics': [2, 13, 18, 26, 30, 44  ],
    },
    {
        'id': 2,
        'name': 'Сбор, обработка и хранение персональных данных',
        'topics': [0, 1, 3, 12, 15, 22, 28, 32, 37, 41,  ],
    },
    {
        'id': 3,
        'name': 'Распространение и уничтожение персональных данных',
        'topics': [19, 39, 40, 24,  ],
    },
    {
        'id': 4,
        'name': 'Изменение персональных данных',
        'topics': [17, 36 ],
    },
    {
        'id': 5,
        'name': 'Разрешение споров',
        'topics': [6,  ],
    },
    {
        'id': 6,
        'name': 'Уведомления, маркетинг и персонализация',
        'topics': [16, 20,  ],
    },
    {
        'id': 7,
        'name': 'Цели обработки персональных данных',
        'topics': [4, 25, 29, 38,  ],
    },
    {
        'id': 8,
        'name': 'Защита персональных данных',
        'topics': [31, 42,  ],
    },
    {
        'id': 9,
        'name': 'Правовые основания обработки персональных данных',
        'topics': [14, 21, 23, 33, 35,  ],
    },
    {
        'id': 10,
        'name': 'Обновление политики безопасности',
        'topics': [43,  ],
    },
    {
        'id': 11,
        'name': 'Согласие пользователя на обработку персональных данных',
        'topics': [9, 27,  ],
    },
]
