# GROUPS_TEMPLATE = [
#     {
#         'id': 0,
#         'name': '',
#         'topics': [],
#     },
#     ...
# ]


GROUPS_WITH_BETTER_PREPROCESS_EN = [
    {
        'id': 0,
        'name': 'Вопросы пользователя по политике безопасности',
        'topics': [0, ],
    },
    {
        'id': 1,
        'name': 'Сторонние веб-сайты',
        'topics': [2, ],
    },
    {
        'id': 2,
        'name': 'Особая аудитория',
        'topics': [3, 6, ],
    },
    {
        'id': 3,
        'name': 'Защита персональных данных',
        'topics': [4, ],
    },
    {
        'id': 4,
        'name': 'Сбор персональных данных',
        'topics': [5, 9, 10, 1, 12, 14, 17, 21, 22, ],
    },
    {
        'id': 5,
        'name': 'Сбор трекинговых персональных данных',
        'topics': [18, ],
    },
    {
        'id': 6,
        'name': 'Распространение персональных данных',
        'topics': [7, 11, 15, ],
    },
    {
        'id': 7,
        'name': 'Накопление персональных данных',
        'topics': [8, ],
    },
    {
        'id': 8,
        'name': 'Персонализация и маркетинг',
        'topics': [13, 20, ],
    },
    {
        'id': 9,
        'name': 'Изменение политики безопасности',
        'topics': [16, 19, ],
    },
]


GROUPS_WITH_BETTER_PREPROCESS_RU = [
    {
        'id': 0,
        'name': 'Термины и определения политики',
        'topics': [0, ],
    },
    {
        'id': 1,
        'name': 'Сбор трекинговых персональных данных',
        'topics': [1, 7, 17, 23, ],
    },
    {
        'id': 2,
        'name': 'Сбор, обработка и хранение персональных данных',
        'topics': [9, 16, 37, 39, 40, 41],
    },
    {
        'id': 3,
        'name': 'Распространение и уничтожение персональных данных',
        'topics': [10, 22, 25, 27, 29, 38, ],
    },
    {
        'id': 4,
        'name': 'Изменение персональных данных',
        'topics': [30, ],
    },
    {
        'id': 5,
        'name': 'Ответственность сторон',
        'topics': [2, 4, 14, 35, ],
    },
    {
        'id': 6,
        'name': 'Разрешение споров',
        'topics': [13, 31, ],
    },
    {
        'id': 7,
        'name': 'Уведомления, маркетинг и персонализация',
        'topics': [3, 32, 43, ],
    },
    {
        'id': 8,
        'name': 'Цели обработки персональных данных',
        'topics': [5, 6, 15, 36, ],
    },
    {
        'id': 9,
        'name': 'Защита персональных данных',
        'topics': [8, 12, 28, 33, 34, ],
    },
    {
        'id': 10,
        'name': 'Правовые основания обработки персональных данных',
        'topics': [11, 18, 19, 42, ],
    },
    {
        'id': 11,
        'name': 'Обновление политики безопасности',
        'topics': [20, 26, ],
    },
    {
        'id': 12,
        'name': 'Согласие пользователя на обработку персональных данных',
        'topics': [21, 24, ],
    },
]
